app/controllers/drinks_controller.rb

SELECT "drinks".* FROM "drinks"
---
  def index
    drink = Drink.all