app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods"
---
  def index
    food = Food.all