app/controllers/line_items_controller.rb

  def create


    order = Order.find_by status: 'pending'

    if order == nil
      order = Order.create(
        table_id: params[:table_id],
        status: :pending
      )
    end


      item = LineItem.create(
        quantity: 1,
        order_id: order.id,
        menu_item_id: params[:item_id],
        server_name: params[:server_id]
      )
---
SELECT  "orders".* FROM "orders" WHERE "orders"."status" = $1 LIMIT $2  [["status", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("created_at", "updated_at", "table_id", "status") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-03-18 23:02:03.128237"], ["updated_at", "2022-03-18 23:02:03.128237"], ["table_id", 3], ["status", 1]]
INSERT INTO "line_items" ("quantity", "order_id", "menu_item_id", "created_at", "updated_at", "server_name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["quantity", 1], ["order_id", 1], ["menu_item_id", 6], ["created_at", "2022-03-20 02:06:09.816318"], ["updated_at", "2022-03-20 02:06:09.816318"], ["server_name", "Bob"]]