app/controllers/menu_items_controller.rb

  def index
    menuItems = MenuItem.all
---
SELECT "menu_items".* FROM "menu_items"