app/controllers/servers_controller.rb

  def index
    server = Server.all
---
SELECT "servers".* FROM "servers"