app/controllers/tables_controller.rb

  def index
    table = Table.all
---
SELECT "tables".* FROM "tables"